#pragma once
//=====================================================================//
/*! @file
    @brief  電卓関数定義
    @author 平松邦仁 (hira@rvf-rc45.net)
	@copyright	Copyright (C) 2020 Kunihito Hiramatsu @n
				Released under the MIT license @n
				https://github.com/hirakuni45/RX/blob/master/LICENSE
*/
//=====================================================================//


namespace utils {

    //+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++//
    /*!
        @brief  CALC DEF クラス
    */
    //+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++//
    class calc_def {
	public:
		//=============================================================//
		/*!
			@brief  シンボル (0x80 to 0xBF)、関数 (0xC0 to 0xFF)、定義
		*/
		//=============================================================//
		enum class NAME : uint8_t {
			PI = 0x80,		///< PI

			SIN = 0xC0,		///< sin(x)
			COS,			///< cos(x)
			TAN,			///< tan(x)

			SQRT,			///< sqrt(x)
			LOG,			///< log(x)
			LN,				///< ln(x)
		};


		//=============================================================//
		/*!
			@brief  角度表現定義
		*/
		//=============================================================//
		enum class ATYPE : uint8_t {
			Deg,	///< Deg 度数法 (360)
			Rad,	///< Rad 弧度法 (2pai)
			Grad	///< 具ラード (400)
		};
	};
}
