#pragma once
//=====================================================================//
/*!	@file
	@brief	シンボル・クラス
	@author	平松邦仁 (hira@rvf-rc45.net)
*/
//=====================================================================//
#include <cstdint>
#include <cstring>
#include "buff.hpp"

namespace utils {

	//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++//
	/*!
		@brief	シンボル・テンプレート・クラス
		@param[in]	VAL	基本となる変数の型
		@param[in]	BUFF	バッファ定義
	*/
	//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++//
	template <typename VAL, class BUFF>
	class symbol
	{
		BUFF&	buff_;

	public:
		//-----------------------------------------------------------------//
		/*!
			@brief	コンストラクター
			@param[in]	buff	バッファ・クラス（参照）
		*/
		//-----------------------------------------------------------------//
		symbol(BUFF& buff) : buff_(buff) { }


		//-----------------------------------------------------------------//
		/*!
			@brief	検索
			@param[in]	key	検索キー
			@return ヒットすれば「true」
		*/
		//-----------------------------------------------------------------//
		bool find(const char* key) {
			uint16_t pos = buff_.get_back_org();
			while(pos < buff_.get_back_end()) {

			}
			return true;
		}


	};
}

