#pragma once
//=====================================================================//
/*!	@file
	@brief	GUI Widget スライダー・クラス（ヘッダー）
	@author	平松邦仁 (hira@rvf-rc45.net)
*/
//=====================================================================//
#include <bitset>
#include "widget_director.hpp"

namespace gui {

	//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++//
	/*!
		@brief	GUI widget_slider クラス
	*/
	//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++//
	struct widget_slider : public widget {

		typedef widget_slider value_type;

		//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++//
		/*!
			@brief	widget_slider パラメーター
		*/
		//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++//
		struct param {
			widget::plate_param		plate_param_;	///< プレートパラメーター
			widget::color_param		color_param_;	///< カラーパラメーター
			widget::slider_param	slider_param_;	///< スライダーパラメーター

			const img::i_img*		base_image_;	///< ベース画像を使う場合
			const img::i_img*		hand_image_;	///< ハンドル画像を使う場合

			bool					hand_ctrl_;		///< ハンドル・コントロール

			param() : plate_param_(),
				color_param_(widget_director::default_slider_color_),
				slider_param_(),
				base_image_(0), hand_image_(0), hand_ctrl_(true)
				{ }
		};

	private:
		widget_director&	wd_;

		param				param_;

		float				ref_position_;
		vtx::spos			ref_point_;

		vtx::spos			handle_offset_;

		gl::glmobj::handle	base_h_;	///< ベース
		gl::glmobj::handle	hand_h_;	///< ハンドル

	public:
		//-----------------------------------------------------------------//
		/*!
			@brief	コンストラクター
		*/
		//-----------------------------------------------------------------//
		widget_slider(widget_director& wd, const widget::param& wp, const param& p) :
			wd_(wd), widget(wp), param_(p), ref_position_(0.0f),
			handle_offset_(0), base_h_(0), hand_h_(0)
		{ }


		//-----------------------------------------------------------------//
		/*!
			@brief	デストラクター
		*/
		//-----------------------------------------------------------------//
		virtual ~widget_slider() { }


		//-----------------------------------------------------------------//
		/*!
			@brief	型を取得
		*/
		//-----------------------------------------------------------------//
		type_id type() const { return get_type_id<value_type>(); }


		//-----------------------------------------------------------------//
		/*!
			@brief	ハイブリッド・ウィジェットのサイン
			@return ハイブリッド・ウィジェットの場合「true」を返す。
		*/
		//-----------------------------------------------------------------//
		bool hybrid() const { return false; }


		//-----------------------------------------------------------------//
		/*!
			@brief	個別パラメーターへの取得(ro)
			@return 個別パラメーター
		*/
		//-----------------------------------------------------------------//
		const param& get_local_param() const { return param_; }


		//-----------------------------------------------------------------//
		/*!
			@brief	個別パラメーターへの取得
			@return 個別パラメーター
		*/
		//-----------------------------------------------------------------//
		param& at_local_param() { return param_; }


		//-----------------------------------------------------------------//
		/*!
			@brief	初期化
		*/
		//-----------------------------------------------------------------//
		void initialize();


		//-----------------------------------------------------------------//
		/*!
			@brief	アップデート
		*/
		//-----------------------------------------------------------------//
		void update();


		//-----------------------------------------------------------------//
		/*!
			@brief	レンダリング
		*/
		//-----------------------------------------------------------------//
		void render();
	};
}
