#pragma once
//=====================================================================//
/*!	@file
	@brief	widget zero クラス（ヘッダー）
	@author	平松邦仁 (hira@rvf-rc45.net)
*/
//=====================================================================//
#include "widget_director.hpp"

namespace gui {

	//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++//
	/*!
		@brief	GUI widget_zero クラス
	*/
	//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++//
	struct widget_zero : public widget {

		//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++//
		/*!
			@brief	widget_zero パラメーター
		*/
		//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++//
		struct param {
			int			round_radius_;
			int			frame_width_;
			int			space_;
			int			bar_width_;
			widget::color_param		color_param_;

			bool		cross_;

			param() : round_radius_(3), frame_width_(3), space_(2), bar_width_(4),
				color_param_(), cross_(false) { }
		};

	private:
		widget_director&	director_;

		param				param_;

		gl::glmobj::handle	hobj_minus_;
		gl::glmobj::handle	hobj_cross_;

		unsigned int		count_;

	public:
		//-----------------------------------------------------------------//
		/*!
			@brief	コンストラクター
		*/
		//-----------------------------------------------------------------//
		widget_zero(widget_director& wd, const widget::param& bp, const param& p) :
			director_(wd), widget(bp), param_(p),
			hobj_minus_(0), hobj_cross_(0), count_(0) { }


		//-----------------------------------------------------------------//
		/*!
			@brief	デストラクター
		*/
		//-----------------------------------------------------------------//
		virtual ~widget_zero() { destroy(); }


		//-----------------------------------------------------------------//
		/*!
			@brief	初期化
		*/
		//-----------------------------------------------------------------//
		void initialize();


		//-----------------------------------------------------------------//
		/*!
			@brief	アップデート
		*/
		//-----------------------------------------------------------------//
		void update();


		//-----------------------------------------------------------------//
		/*!
			@brief	レンダリング
		*/
		//-----------------------------------------------------------------//
		void render();


		//-----------------------------------------------------------------//
		/*!
			@brief	廃棄
		*/
		//-----------------------------------------------------------------//
		void destroy();

	};

}
