#pragma once
//=====================================================================//
/*!	@file
	@brief	GUI widget group（ヘッダー）
	@author	平松邦仁 (hira@rvf-rc45.net)
*/
//=====================================================================//
#include "widgets/widget.hpp"
#include "widgets/widget_director.hpp"

namespace gui {

	//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++//
	/*!
		@brief	グループ・クラス
	*/
	//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++//
	class widget_group {
		widget_director&	wd_;

		widget*		root_;

		widgets		widgets_;

	public:
		//-----------------------------------------------------------------//
		/*!
			@brief	コンストラクター
		*/
		//-----------------------------------------------------------------//
		widget_group(widget_director& wd) : wd_(wd),
			root_(0) { }


		//-----------------------------------------------------------------//
		/*!
			@brief	初期化
		*/
		//-----------------------------------------------------------------//
		void initialize(const vtx::srect& rect) {
//			widget::param wp(rect);
//			widget_null::param wp_;
//			root_ = wd_.add_widget<widget_null>(wp, wp_);
		}



//		uint32_t add(widget* w);




		//-----------------------------------------------------------------//
		/*!
			@brief	グループのルートを取得
			@return ルート
		*/
		//-----------------------------------------------------------------//
		widget* get_root() const { return root_; }
	};

}


