#pragma once
//=====================================================================//
/*! @file
	@brief  Emulator Tools クラス @n
			Copyright 2017 Kunihito Hiramatsu
	@author 平松邦仁 (hira@rvf-rc45.net)
*/
//=====================================================================//
#include "widgets/widget_terminal.hpp"

//#include "emu/nes/nes.hpp"
#include "emu/cpu/dis6502.hpp"

namespace emu {

	//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++//
	/*!
		@brief	エミュレーター Tools クラス
	*/
	//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++//
	class tools {

		static gui::widget_terminal*	terminal_;

	public:
		//-----------------------------------------------------------------//
		/*!
			@brief  コンストラクター
		*/
		//-----------------------------------------------------------------//
		tools() { }


		//-----------------------------------------------------------------//
		/*!
			@brief  ターミナル・コンテキストを設定
			@param[in]	term	ターミナル・コンテキスト
		*/
		//-----------------------------------------------------------------//
		static void set_terminal(gui::widget_terminal* t) { terminal_ = t; }


		//-----------------------------------------------------------------//
		/*!
			@brief  出力
		*/
		//-----------------------------------------------------------------//
		static void put(const char* text) {
			if(terminal_ == nullptr) return;
			terminal_->output(text);
		}


	};
}
